/*!
 ******************************************************************************
 * @file:    uhf.h
 * @brief:   UHF Device Definitions for ADuCRFxxx
 * @version: $Revision: 13580 $
 * @date:    $Date: 2012-04-06 16:16:27 -0400 (Fri, 06 Apr 2012) $
 *-----------------------------------------------------------------------------
 *
Copyright (c) 2010 Analog Devices, Inc.

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:
  - Redistributions of source code must retain the above copyright notice,
    this list of conditions and the following disclaimer.
  - Redistributions in binary form must reproduce the above copyright notice,
    this list of conditions and the following disclaimer in the documentation
    and/or other materials provided with the distribution.
  - Modified versions of the software must be conspicuously marked as such.
  - This software is licensed solely and exclusively for use with processors
    manufactured by or for Analog Devices, Inc.
  - This software may not be combined or merged with other code in any manner
    that would cause the software to become subject to terms and conditions
    which differ from those listed here.
  - Neither the name of Analog Devices, Inc. nor the names of its
    contributors may be used to endorse or promote products derived
    from this software without specific prior written permission.

    ADI_ADF7023_CMD_SPI_NOP          =  0xFF,         /*!<  7023 NOP command  */

    /* Radio controller commands */
    ADI_ADF7023_CMD_SYNC             =  0xA2,         /*!<  Command sync command */
    ADI_ADF7023_CMD_PHY_OFF          =  0xB0,         /*!<  Command to turn PHY OFF */
    ADI_ADF7023_CMD_PHY_ON           =  0xB1,         /*!<  Command to turn PHY ON  */
    ADI_ADF7023_CMD_PHY_RX           =  0xB2,         /*!<  Command to turn PHY RX  */
    ADI_ADF7023_CMD_PHY_TX           =  0xB5,         /*!<  Command to turn PHY TX  */
    ADI_ADF7023_CMD_PHY_SLEEP        =  0xBA,         /*!<  Command to set PHY to sleep mode  */
    ADI_ADF7023_CMD_CONFIG_DEV       =  0xBB,         /*!<  Command to configure radio after updating BBRAM registers  */
    ADI_ADF7023_CMD_GET_RSSI         =  0xBC,         /*!<  Command to get current RSSI  */
    ADI_ADF7023_CMD_IR_CAL           =  0xBD,         /*!<  Command to perform IR calibration  */
    ADI_ADF7023_CMD_BB_CAL           =  0xBE,         /*!<  Command to perform BB calibration  */
    ADI_ADF7023_CMD_RAM_LOAD_INIT    =  0xBF,         /*!<  Command to load code into the program RAM area of the 7023 */
    ADI_ADF7023_CMD_RAM_LOAD_DONE    =  0xC7,         /*!<  Command to let 7023 know that code loading in program RAM is complete  */
    ADI_ADF7023_CMD_HW_RESET	     =  0xC8,         /*!<  Command to reset the 7023  */
    ADI_ADF7023_CMD_AES_ENCRYPT      =  0xD0,         /*!<  Command to perform AES encryption  */
    ADI_ADF7023_CMD_AES_DECRYPT      =  0xD2,         /*!<  Command to perform AES decryption */
    ADI_ADF7023_CMD_AES_DECRYPT_INIT =  0xD1,         /*!<  Command to initiate AES decryption mode */
#ifdef PATCH_802_15_4D
    ADI_ADF7023_CMD_ENTER_15D4_MODE  = 0xC1, 		  /*!<	Transions from PHY_ON to PHY_ON_15d4 */
    ADI_ADF7023_CMD_EXIT_15D4_MODE   = 0xB1, 		  /*!<  Transions from PHY_ON_15d4 to PHY_ON */
    ADI_ADF7023_CMD_PHY_RX_CCA_15D4  = 0xB2, 		  /*!<  Transions from XXXX_15d4 states to PHY_RX_CCA_15d4 */
    ADI_ADF7023_CMD_PHY_TX_15D4      = 0xB5, 		  /*!<  Transions from XXXX_15d4 states to PHY_TX_15d4 */
    ADI_ADF7023_CMD_PHY_ON_15D4      = 0xB1, 		  /*!<  Transions from PHY_TX_15d4,PHY_RX_CCA_15d4 states to PHY_ON_15d4 */
    ADI_ADF7023_CMD_SYNTH_CAL_15D4   = 0xEE, 		  /*!<  Carry out a full synth calibration, makes for fast RX,TX */
    ADI_ADF7023_CMD_CCA_START        = 0xB7,		  /*!<  Starts the CCA timer sets the CCA_flag  */
    ADI_ADF7023_CMD_CCA_STOP         = 0xB8, 		  /*!<  Stops the CCA timer clears the CCA_flag */
    ADI_ADF7023_CMD_CCA_FILTER       = 0xB9  		  /*!<  Sets the RXBB Filter to the value in BIT_CCA_FILTER_REG */
#endif
} ADI_ADF7023_CMD_TYPE;


typedef void (* ADI_ADF7023_CALLBACK)
(     /* Callback function pointer                */
    void    *pCBParam,                  /* Client supplied callback param           */
    u32     nEvent,                     /* Event ID                                 */
    void    *pArg);                     /* Pointer to the event specific argument   */

typedef struct
{
  unsigned char interrupt_mask_0_r;                   // 0x100
  unsigned char interrupt_mask_1_r;                   // 0x101
  unsigned char number_of_wakeups_0_r;                // 0x102
  unsigned char number_of_wakeups_1_r;                // 0x103
  unsigned char number_of_wakeups_irq_threshold_0_r;  // 0x104
  unsigned char number_of_wakeups_irq_threshold_1_r;  // 0x105
  unsigned char rx_dwell_time_r;                      // 0x106
  unsigned char parmtime_divider_r;                   // 0x107
  unsigned char swm_rssi_thresh_r;                    // 0x108
  unsigned char channel_freq_0_r;                     // 0x109
  unsigned char channel_freq_1_r;                     // 0x10A
  unsigned char channel_freq_2_r;                     // 0x10B
  unsigned char radio_cfg_0_r;                        // 0x10C
  unsigned char radio_cfg_1_r;                        // 0x10D
  unsigned char radio_cfg_2_r;                        // 0x10E
  unsigned char radio_cfg_3_r;                        // 0x10F
  unsigned char radio_cfg_4_r;                        // 0x110
  unsigned char radio_cfg_5_r;                        // 0x111
  unsigned char radio_cfg_6_r;                        // 0x112
  unsigned char radio_cfg_7_r;                        // 0x113
  unsigned char radio_cfg_8_r;                        // 0x114
  unsigned char radio_cfg_9_r;                        // 0x115
  unsigned char radio_cfg_10_r;                       // 0x116
  unsigned char radio_cfg_11_r;                       // 0x117
  unsigned char image_reject_cal_phase_r;             // 0x118
  unsigned char image_reject_cal_amplitude_r;         // 0x119
  unsigned char mode_control_r;                       // 0x11A
  unsigned char preamble_match_r;                     // 0x11B
  unsigned char symbol_mode_r;                        // 0x11C
  unsigned char preamble_len_r;                       // 0x11D
  unsigned char crc_poly_0_r;                         // 0x11E
  unsigned char crc_poly_1_r;                         // 0x11F
  unsigned char sync_control_r;                       // 0x120
  unsigned char sync_byte_0_r;                        // 0x121
  unsigned char sync_byte_1_r;                        // 0x122
  unsigned char sync_byte_2_r;                        // 0x123
  unsigned char tx_base_adr_r;                        // 0x124
  unsigned char rx_base_adr_r;                        // 0x125
  unsigned char packet_length_control_r;              // 0x126
  unsigned char packet_length_max_r;                  // 0x127
  unsigned char static_reg_fix_r;                     // 0x128
  unsigned char address_match_offset_r;               // 0x129
  unsigned char address_filtering_r[0x14];            // 0x12A - 0x13D
  unsigned char rx_synth_lock_time_r;                 // 0x13E
  unsigned char tx_synth_lock_time_r;                 // 0x13F
} TyBBRAM;

#ifndef DISABLE_PATCH_802_15_4D

typedef struct
{
  unsigned char bb_cca_cfg_0;                        // 0x103
  unsigned char bb_cca_cfg_1;                        // 0x104
  unsigned char bb_ca_threshold;                     // 0x105
} TyBBRAM15_4d_CCA;

#endif // DISABLE_PATCH_802_15_4D

/*!
 *****************************************************************************
 * \struct ADI_ADF7023_SHORT_ADDR_TYPE
 *
 * UHF short address type. Used to pass radio short address and short address mask to the driver.
 *****************************************************************************/
typedef struct
{
	u16 ShortAddr;                         /*!< Radio short address */
    u16 ShortAddrMask;                     /*!< Short address mask */
} ADI_ADF7023_SHORT_ADDR_TYPE;


/*!
 *****************************************************************************
 * \struct ADI_ADF7023_GENERIC_SETTINGS_TYPE
 *
 * UHF Device Generic Settings Structure. Set basic settings for the radio in a single call.
 *****************************************************************************/
typedef struct
{
    u16                         DataRate;        /*!< Set radio data rate */
    u32                         Frequency;       /*!< Set radio frequency */
    ADI_ADF7023_SHORT_ADDR_TYPE     ShortAddr;       /*!< Set radio short address */
    ADI_ADF7023_MOD_TYPE            ModScheme;       /*!< Set radio modulation scheme */
    ADI_ADF7023_DEMOD_TYPE          DemodScheme;     /*!< Set radio demodulation scheme */
} ADI_ADF7023_GENERIC_SETTINGS_TYPE;


/*!
 * ***************************************************************************
 * \struct ADI_ADF7023_BUFFER_TYPE
 *
 * UHF buffer type.
 * ***************************************************************************/
typedef struct {

    u32              ElementCount;
    u8*              pData;
    volatile bool    bBufferProcessed;
} ADI_ADF7023_BUFFER_TYPE;


/*!
 *****************************************************************************
 * \struct ADI_ADF7023_BBRAM_TYPE
 *
 * UHF device internal register names. For more details please refer to the ADuCRF101 User Guide.
 *****************************************************************************/
typedef struct
{
    u8 interrupt_mask_0_r;                   /*!< Register address 0x100 Interrupt mask */
    u8 interrupt_mask_1_r;                   /*!< Register address 0x101 Interrupt mask */
    u8 number_of_wakeups_0_r;                /*!< Register address 0x102 Wake up controller*/
    u8 number_of_wakeups_1_r;                /*!< Register address 0x103 Wake up controller */
    u8 number_of_wakeups_irq_threshold_0_r;  /*!< Register address 0x104 WUC irq */
    u8 number_of_wakeups_irq_threshold_1_r;  /*!< Register address 0x105 WUC irq */
    u8 max_wakeup_2_sync_time_r;             /*!< Register address 0x106 WUC sync */
    u8 parmtime_divider_r;                   /*!< Register address 0x107 WUC div */
    u8 listen_rssi_thresh_r;                 /*!< Register address 0x108 RSSI threshold register for wakeup*/
    u8 channel_freq_0_r;                     /*!< Register address 0x109 To set radio frequency (lower byte)*/
    u8 channel_freq_1_r;                     /*!< Register address 0x10A To set radio frequency (middle byte)*/
    u8 channel_freq_2_r;                     /*!< Register address 0x10B To set radio frequency (upper byte)*/
    u8 radio_cfg_0_r;                        /*!< Register address 0x10C Radio data rate */
    u8 radio_cfg_1_r;                        /*!< Register address 0x10D Data rate (3:0) +  freq_deviation (7:4) */
    u8 radio_cfg_2_r;                        /*!< Register address 0x10E Frequency deviation */
    u8 radio_cfg_3_r;                        /*!< Register address 0x10F Discriminator_bw */
    u8 radio_cfg_4_r;                        /*!< Register address 0x110 Post demodulation bandwidth */
    u8 radio_cfg_5_r;                        /*!< Register address 0x111 T4 phase adjust lsb */
    u8 radio_cfg_6_r;                        /*!< Register address 0x112 None */
    u8 radio_cfg_7_r;                        /*!< Register address 0x113 None */
    u8 radio_cfg_8_r;                        /*!< Register address 0x114 Power amplifier settings */
    u8 radio_cfg_9_r;                        /*!< Register address 0x115 Mod/demod settings */
    u8 radio_cfg_10_r;                       /*!< Register address 0x116 Afc settings 0 */
    u8 radio_cfg_11_r;                       /*!< Register address 0x117 Afc settings 1 */
   	u8 ir_cal_phase_r;                       /*!< Register address 0x118 IR calibration phase setting */
    u8 ir_cal_amplitude_r;                   /*!< Register address 0x119 IR calibration gain setting */
    u8 mode_control_r;                       /*!< Register address 0x11A Radio settings */
    u8 preamble_match_r;                     /*!< Register address 0x11B Preamble settings */
    u8 symbol_mode_r;                        /*!< Register address 0x11C Symbol config settings */
    u8 preamble_len_r;                       /*!< Register address 0x11D Preamble length register*/
    u8 CRC_poly_low_r;                       /*!< Register address 0x11E User defined CRC polynomial (low byte)*/
    u8 CRC_poly_high_r;                      /*!< Register address 0x11F User defined CRC polynomial (high byte)*/
    u8 sync_control_r;                       /*!< Register address 0x120 Syncword settings */
    u8 sync_byte_0_r;                        /*!< Register address 0x121 Sync word (low byte)*/
    u8 sync_byte_1_r;                        /*!< Register address 0x122 Sync word (mid byte)*/
    u8 sync_byte_2_r;                        /*!< Register address 0x123 Sync word (high byte)*/
    u8 tx_base_adr_r;                        /*!< Register address 0x124 Start address of a TX packet in packet RAM*/
    u8 rx_base_adr_r;                        /*!< Register address 0x125 Start address of a RX packet in packet RAM*/
    u8 packet_length_control_r;              /*!< Register address 0x126 Variable or fixed packet length*/
    u8 packet_length_max_r;                  /*!< Register address 0x127 Maximum packet length*/
    u8 Static_Reg_fix_r;                     /*!< Register address 0x128 None [7:0] static_reg_fix_addr RW 0 Pointer to the first address on BBRAM for the automatic register fix */
    u8 Address_Match_Offset_r;               /*!< Register address 0x129 None [7:0] address_match_offset RW 0 Location of first byte of address information in Packet RAM */
    u8 Address_Length_r;                     /*!< Register address 0x12A None [7:0] address_length RW 0 Number of bytes in each address field (NADR) */
    u8 Address_match_byte_0;                 /*!< Register address 0x12B First byte of radio address*/
    u8 Address_mask_byte_0 ;                 /*!< Register address 0x12C Address maske.g 0xFF if entire byte significant */
    u8 Address_match_byte_1;                 /*!< Register address 0x12D Support for more address bytes and masks */
    u8 Address_mask_byte_1 ;                 /*!< Register address 0x12E Support for more address bytes and masks */
    u8 Address_match_byte_2;                 /*!< Register address 0x12F Support for more address bytes and masks */
    u8 Address_mask_byte_2 ;                 /*!< Register address 0x130 Support for more address bytes and masks */
    u8 Address_match_byte_3;                 /*!< Register address 0x131 Support for more address bytes and masks */
    u8 Address_mask_byte_3 ;                 /*!< Register address 0x132 Support for more address bytes and masks */
    u8 Address_match_byte_4;                 /*!< Register address 0x133 Support for more address bytes and masks */
    u8 Address_mask_byte_4 ;                 /*!< Register address 0x134 Support for more address bytes and masks */
    u8 Address_match_byte_5;                 /*!< Register address 0x135 Support for more address bytes and masks */
    u8 Address_mask_byte_5 ;                 /*!< Register address 0x136 Support for more address bytes and masks */
    u8 Address_match_byte_6;                 /*!< Register address 0x137 Support for more address bytes and masks */
    u8 Address_mask_byte_6 ;                 /*!< Register address 0x138 Support for more address bytes and masks */
    u8 Address_match_byte_7;                 /*!< Register address 0x139 Support for more address bytes and masks */
    u8 Address_mask_byte_7 ;                 /*!< Register address 0x13A Support for more address bytes and masks */
    u8 Address_match_byte_8;                 /*!< Register address 0x13B Support for more address bytes and masks */
    u8 Address_mask_byte_8 ;                 /*!< Register address 0x13C Support for more address bytes and masks */
    u8 r_13D;                                /*!< Register address 0x13D  0x0 to end the address sequence */
    u8 RX_synth_lock_time;                   /*!< Register address 0x13E RX synthesizer lock time*/
    u8 TX_synth_lock_time;                   /*!< Register address 0x13F TX synthesizer lock time*/
} ADI_ADF7023_BBRAM_TYPE;


/*!
 *****************************************************************************
 * \enum ADI_ADF7023_BBRAM_ADDR_TYPE
 *
 * UHF device internal register address enumeration
 *****************************************************************************/
typedef enum
{
    BBRAM_BASE       = 0x100,                      /*!< Address 0x100 Base address of BBRAM */
    INTERRUPT_MASK_0 = BBRAM_BASE,                 /*!< Register address 0x100 Interrupt mask */
    INTERRUPT_MASK_1,                              /*!< Register address 0x101 Interrupt mask */
    NUMBER_OF_WAKEUPS_0,                           /*!< Register address 0x102 Wake up controller*/
    NUMBER_OF_WAKEUPS_1,                           /*!< Register address 0x103 Wake up controller */
    NUMBER_OF_WAKEUPS_IRQ_THRESHOLD_0,             /*!< Register address 0x104 WUC irq */
    NUMBER_OF_WAKEUPS_IRQ_THRESHOLD_1,             /*!< Register address 0x105 WUC irq */
    MAX_WAKEUP_2_SYNC_TIME,                        /*!< Register address 0x106 WUC sync */
    PARMTIME_DIVIDER,                              /*!< Register address 0x107 WUC div */
    LISTEN_RSSI_THRESH,                            /*!< Register address 0x108 RSSI threshold register for wakeup*/
    CHANNEL_FREQ_0,                                /*!< Register address 0x109 To set radio frequency (lower byte)*/
    CHANNEL_FREQ_1,                                /*!< Register address 0x10A To set radio frequency (middle byte)*/
    CHANNEL_FREQ_2,                                /*!< Register address 0x10B To set radio frequency (upper byte)*/
    RADIO_CFG_0,                                   /*!< Register address 0x10C Radio data rate */
    RADIO_CFG_1,                                   /*!< Register address 0x10D Data rate (3:0) +  freq_deviation (7:4) */
    RADIO_CFG_2,                                   /*!< Register address 0x10E Frequency deviation */
    RADIO_CFG_3,                                   /*!< Register address 0x10F Discriminator_bw */
    RADIO_CFG_4,                                   /*!< Register address 0x110 Post demodulation bandwidth */
    RADIO_CFG_5,                                   /*!< Register address 0x111 T4 phase adjust lsb */
    RADIO_CFG_6,                                   /*!< Register address 0x112 None */
    RADIO_CFG_7,                                   /*!< Register address 0x113 None */
    RADIO_CFG_8,                                   /*!< Register address 0x114 Power amplifier settings */
    RADIO_CFG_9,                                   /*!< Register address 0x115 Mod/demod settings */
    RADIO_CFG_10,                                  /*!< Register address 0x116 Afc settings 0 */
    RADIO_CFG_11,                                  /*!< Register address 0x117 Afc settings 1 */
    IR_CAL_PHASE,                                  /*!< Register address 0x118 IR calibration phase setting */
    IR_CAL_AMPLITUDE,                              /*!< Register address 0x119 IR calibration gain setting */
    MODE_CONTROL,                                  /*!< Register address 0x11A Radio settings */
    PREAMBLE_MATCH,                                /*!< Register address 0x11B Preamble settings */
    SYMBOL_MODE,                                   /*!< Register address 0x11C Symbol config settings */
    PREAMBLE_LEN_REG,                              /*!< Register address 0x11D Preamble length register*/
    CRC_POLY_LOW,                                  /*!< Register address 0x11E User defined CRC polynomial (low byte)*/
    CRC_POLY_HIGH,                                 /*!< Register address 0x11F User defined CRC polynomial (high byte)*/
    SYNC_CONTROL,                                  /*!< Register address 0x120 Syncword settings */
    SYNC_BYTE_0,                                   /*!< Register address 0x121 Sync word (low byte)*/
    SYNC_BYTE_1,                                   /*!< Register address 0x122 Sync word (mid byte)*/
    SYNC_BYTE_2,                                   /*!< Register address 0x123 Sync word (high byte)*/
    TX_BASE_ADR,                                   /*!< Register address 0x124 Start address of a TX packet in packet RAM*/
    RX_BASE_ADR,                                   /*!< Register address 0x125 Start address of a RX packet in packet RAM*/
    PACKET_LENGTH_CONTROL,                         /*!< Register address 0x126 Variable or fixed packet length*/
    PACKET_LENGTH_MAX,                             /*!< Register address 0x127 Maximum packet length*/
    STATIC_REG_FIX,                                /*!< Register address 0x128 None [7:0] static_reg_fix_addr RW 0 Pointer to the first address on BBRAM for the automatic register fix */
    ADDRESS_MATCH_OFFSET,                          /*!< Register address 0x129 None [7:0] address_match_offset RW 0 Location of first byte of address information in Packet RAM */
    ADDRESS_LENGTH,                                /*!< Register address 0x12A None [7:0] address_length RW 0 Number of bytes in each address field (NADR) */
    ADDRESS_MATCH_BYTE_0,                          /*!< Register address 0x12B First byte of radio address*/
    ADDRESS_MASK_BYTE_0 ,                          /*!< Register address 0x12C Address maske.g 0xFF if entire byte significant */
    ADDRESS_MATCH_BYTE_1,                          /*!< Register address 0x12D Support for more address bytes and masks */
    ADDRESS_MASK_BYTE_1 ,                          /*!< Register address 0x12E Support for more address bytes and masks */
    ADDRESS_MATCH_BYTE_2,                          /*!< Register address 0x12F Support for more address bytes and masks */
    ADDRESS_MASK_BYTE_2 ,                          /*!< Register address 0x130 Support for more address bytes and masks */
    ADDRESS_MATCH_BYTE_3,                          /*!< Register address 0x131 Support for more address bytes and masks */
    ADDRESS_MASK_BYTE_3 ,                          /*!< Register address 0x132 Support for more address bytes and masks */
    ADDRESS_MATCH_BYTE_4,                          /*!< Register address 0x133 Support for more address bytes and masks */
    ADDRESS_MASK_BYTE_4 ,                          /*!< Register address 0x134 Support for more address bytes and masks */
    ADDRESS_MATCH_BYTE_5,                          /*!< Register address 0x135 Support for more address bytes and masks */
    ADDRESS_MASK_BYTE_5 ,                          /*!< Register address 0x136 Support for more address bytes and masks */
    ADDRESS_MATCH_BYTE_6,                          /*!< Register address 0x137 Support for more address bytes and masks */
    ADDRESS_MASK_BYTE_6 ,                          /*!< Register address 0x138 Support for more address bytes and masks */
    ADDRESS_MATCH_BYTE_7,                          /*!< Register address 0x139 Support for more address bytes and masks */
    ADDRESS_MASK_BYTE_7 ,                          /*!< Register address 0x13A Support for more address bytes and masks */
    ADDRESS_MATCH_BYTE_8,                          /*!< Register address 0x13B Support for more address bytes and masks */
    ADDRESS_MASK_BYTE_8 ,                          /*!< Register address 0x13C Support for more address bytes and masks */
    ADDRESS_SEQUENCE_END,                          /*!< Register address 0x13D  0x0 to end the address sequence */
    RX_SYNTH_LOCK_TIME,                            /*!< Register address 0x13E RX synthesizer lock time*/
    TX_SYNTH_LOCK_TIME,                            /*!< Register address 0x13F TX synthesizer lock time*/
} ADI_ADF7023_BBRAM_ADDR_TYPE;


#ifdef PATCH_802_15_4D

#define BBRam154d_MMemmap_Start                    0x129

// The following BBRAM locations are used\defined in 15.4d mode
// These are not stored in our structure...is this ok

#define BB_cca_cfg_0                               0x103
#define BB_cca_cfg_1                               0x104
#define BB_cca_threshold                           0x105

#define PR_phy_rx_status                           0x01F  // for 4.01 version

#define BB_antenna_RX_diversity_cfg				   0x129

#define BB_TX_anetnna_cfg_r 					   0x12A
#define BB_antenna0_rssi                           0x12B
#define BB_antenna1_rssi                           0x12C
#define BB_threshold_diff_rssi                     0x12D


#define BB_nb_preamble_bytes_low                   0x12E // Longer pre-amble
#define BB_nb_preamble_bytes_high                  0x12F // Longer pre-amble
#define BB_sfd_low                                 0x130
#define BB_sfd_high                                0x131
#define BB_PHR_low                                 0x132  // tmp
#define BB_PHR_high                                0x133  // tmp
// The rolling buffer fills from the RX_base_addr with data.
// When the buffer fills a location = RX_base_addr +
// BB_RX_buff_signal with data an interrupt is generated
#define BB_rx_buff_signal                          0x134
// This is the max size of the buffer when the loaction= RX_base_addr +
// BB_RX_buff_size is filled with data the buffer loops back to loaction
// RX_base_addr and fills from here
#define BB_rx_buff_size                            0x135
// The rolling buffer Sends data from the TX_base_addr.
// When the buffer sends data from location = TX_base_addr +
// BB_TX_buff_signal an interrupt is generated
#define BB_tx_buff_signal                          0x136
// This is the max size of the buffer, when data is sent from the
// loaction= TX_base_addr + BB_TX_buff_size the buffer loops back
// to loaction TX_base_addr and send data from here
#define BB_tx_buff_size                            0x137
#define BB_reserved1                               0x138
#define BB_testmodes                               0x139
#define BB_reserved2                               0x13A

// Once the command COMMAND_SYNTH_CAL_15d4 has been issued the results are stored in these registers.
#define BB_vco_band_readback                       0x13B
#define BB_vco_ampl_readback                       0x13C


typedef struct
{
    unsigned char antenna_RX_diversity_cfg_r;             // 0x129
    unsigned char TX_anetnna_cfg_r;
    unsigned char antenna0_rssi_r;                     // 0x12B
    unsigned char antenna1_rssi_r;                     // 0x12C
    unsigned char threshold_diff_rssi_r;               // 0x12D
    unsigned char nb_preamble_bytes_low_r;             // 0x12E
    unsigned char nb_preamble_bytes_high_r;            // 0x12F
    unsigned char sfd_low_r;                           // 0x130
    unsigned char sfd_high_r;                          // 0x131
    unsigned char PHR_low_r;                           // 0x132
    unsigned char PHR_high_r;                          // 0x133
    unsigned char rx_buff_signal_r;                    // 0x134
    unsigned char rx_buff_size_r;                      // 0x135
    unsigned char tx_buff_signal_r;                    // 0x136
    unsigned char tx_buff_size_r;                      // 0x137
    unsigned char reserved1_r;                         // 0x138
    unsigned char testmodes_r;                         // 0x139
    unsigned char reserved2_r;                         // 0x13A
//    unsigned char vco_band_readback_r;                 // 0x13B
//    unsigned char vco_ampl_readback_r;                 // 0x13C
} TyBBRAM15_4d;

//We should not overwrite vco_band_readback_r and vco_ampl_readback_r registers,

typedef enum
{
	ADI_ADF7023J_15D4_ANTENNA0 = 0,
	ADI_ADF7023J_15D4_ANTENNA1,
} ADI_ADF7023J_15D4_TRX_ANTENNA_SELECTED;

typedef enum
{
    ADI_ADF7023J_15D4_VDD_DRV = 0,                 // VDD driver selected
    ADI_ADF7023J_15D4_1_8V_DRV,                    // 1.8V driver selected
} ADI_ADF7023J_15D4_TRX_ATB_LEVEL;

typedef enum
{
    ADI_ADF7023J_15D4_AD_DISABLE = 0,
    ADI_ADF7023J_15D4_AD_ENABLE,
} ADI_ADF7023J_15D4_RX_ANTENNA_DIVERSITY;

typedef enum
{
  ADI_ADF7023J_4BYTE_FCS = 0,
  ADI_ADF7023J_2BYTE_FCS,
} ADI_ADF7023_15D4_FCS_TYPE;
#endif

typedef enum
{
    CCA_FILTER_BW_100_KHZ = 0,
    CCA_FILTER_BW_150_KHZ,
    CCA_FILTER_BW_200_KHZ,
    CCA_FILTER_BW_300_KHZ,
